 # DATA CLEANING WITH PANDAS


 Data source - https://data.cityofnewyork.us/Environment/2015-Street-Tree-Census-Tree-Data/uvpi-gqnh/about_data

Handling pandas dataframe - https://sparkbyexamples.com/pandas/how-to-count-duplicates-in-pandas-dataframe/

In [1]:
# Install required modules
%pip install pandas
%pip install matplotlib
%pip install seaborn

Requirement already satisfied: pandas in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (2.2.1)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: numpy<2,>=1.26.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\admin\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Requirement already satisfied: matplotlib in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.4.5)
Requirement already satisfied: numpy<2,>=1.21 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (1.26.4)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: seaborn in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (0.13.2)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (1.26.4)
Requirement already satisfied: pandas>=1.2 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (2.2.1)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from seaborn) (3.8.3)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.2.0)
Requirement already satisfied: cycler>=0.10 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.49.0)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.5)
Requirement already satisfied: packaging>=20.0 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (24.0)
Requirement already satisfied: pillow>=8 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (10.2.0)
Requirement already satisfied: pyparsing>=2.3.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.1.2)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\admin\appdata\roaming\python\python312\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\admin\appdata\local\programs\python\python312\lib\site-packages (from pandas>=1.2->seaborn) (2024.1)
Requirement already satisfied: six>=1.5 in c:\users\admin\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [48]:
# Import data abd show one 
df = pd.read_csv('../Data Cleaning Pandas/Data/NewYorkTreesHealthCensus.csv')
df.sample()

,created_at,tree_id,block_id,the_geom,tree_dbh,stump_diam,curb_loc,status,health,spc_latin,...,st_assem,st_senate,nta,nta_name,boro_ct,state,Latitude,longitude,x_sp,y_sp
38543,10/13/2015,583484.0,412069.0,POINT (-74.23968110493125 40.505044735164056),0.0,10,OnCurb,Stump,NaN,NaN,...,62.0,24.0,SI11,Charleston-Richmond Valley-Tottenville,5024402.0,New York,40.505045,-74.239681,917596.7652,123369.2773

## Explore the dataframe

In [49]:
# View structure of dataframe
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 42 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   created_at  50000 non-null  object
 1   tree_id     49873 non-null  float64
 2   block_id    49967 non-null  float64
 3   the_geom    50000 non-null  object
 4   tree_dbh    49895 non-null  float64
 5   stump_diam  50000 non-null  int64
 6   curb_loc    50000 non-null  object
 7   status      49674 non-null  object
 8   health      47732 non-null  object
 9   spc_latin   47732 non-null  object
 10  spc_common  47732 non-null  object
 11  steward     10715 non-null  object
 12  guards      4953 non-null   object
 13  sidewalk    47732 non-null  object
 14  user_type   50000 non-null  object
 15  problems    15603 non-null  object
 16  root_stone  50000 non-null  object
 17  root_grate  50000 non-null  object
 18  root_other  50000 non-null  object
 19  trnk_wire   50000 non-null  object
 20  trnk_light  50000 non-null  object
 21  trnk_other  50000 non-null  object
 22  brnch_ligh  50000 non-null  object
 23  brnch_shoe  50000 non-null  object
 24  brnch_othe  50000 non-null  object
 25  address     50000 non-null  object
 26  zipcode     50000 non-null  int64
 27  zip_city    50000 non-null  object
 28  cb_num      50000 non-null  float64
 29  borocode    50000 non-null  float64
 30  boroname    49976 non-null  object
 31  cncldist    50000 non-null  float64
 32  st_assem    50000 non-null  float64
 33  st_senate   50000 non-null  float64
 34  nta         50000 non-null  object
 35  nta_name    50000 non-null  object
 36  boro_ct     50000 non-null  float64
 37  state       50000 non-null  object
 38  Latitude    50000 non-null  float64
 39  longitude   50000 non-null  float64
 40  x_sp        50000 non-null  float64
 41  y_sp        50000 non-null  float64
dtypes: float64(13), int64(2), object(27)
memory usage: 16.0+ MB

In [50]:
# Structure 
print('Dimension of data : ', df.shape)
print('Dataframe type : ', type(df))

Dimension of data :  (50000, 42)
Dataframe type :  <class 'pandas.core.frame.DataFrame'>

### Subset Data
This is a large dataset, lets subset the data by randomly selecting 5000 observations.

In [51]:
# Select 2000 random rows

subset = df.sample(n=2000)
subset.shape

(2000, 42)

In [52]:
# display all the rows
pd.set_option("display.max_rows", None)

### Drop Columns.

In [53]:
# Column data types
subset.dtypes

created_at     object
tree_id       float64
block_id      float64
the_geom       object
tree_dbh      float64
stump_diam      int64
curb_loc       object
status         object
health         object
spc_latin      object
spc_common     object
steward        object
guards         object
sidewalk       object
user_type      object
problems       object
root_stone     object
root_grate     object
root_other     object
trnk_wire      object
trnk_light     object
trnk_other     object
brnch_ligh     object
brnch_shoe     object
brnch_othe     object
address        object
zipcode         int64
zip_city       object
cb_num        float64
borocode      float64
boroname       object
cncldist      float64
st_assem      float64
st_senate     float64
nta            object
nta_name       object
boro_ct       float64
state          object
Latitude      float64
longitude     float64
x_sp          float64
y_sp          float64
dtype: object

In [54]:
# Print column names
subset.columns.values

array(['created_at', 'tree_id', 'block_id', 'the_geom', 'tree_dbh',
       'stump_diam', 'curb_loc', 'status', 'health', 'spc_latin',
       'spc_common', 'steward', 'guards', 'sidewalk', 'user_type',
       'problems', 'root_stone', 'root_grate', 'root_other', 'trnk_wire',
       'trnk_light', 'trnk_other', 'brnch_ligh', 'brnch_shoe',
       'brnch_othe', 'address', 'zipcode', 'zip_city', 'cb_num',
       'borocode', 'boroname', 'cncldist', 'st_assem', 'st_senate', 'nta',
       'nta_name', 'boro_ct', 'state', 'Latitude', 'longitude', 'x_sp',
       'y_sp'], dtype=object)

In [55]:
# Check columns of integer values
subset.describe()

,tree_id,block_id,tree_dbh,stump_diam,zipcode,cb_num,borocode,cncldist,st_assem,st_senate,boro_ct,Latitude,longitude,x_sp,y_sp
count,1997.000000,2000.000000,1997.000000,2000.000000,2000.000000,2000.00000,2000.000000,2000.000000,2000.000000,2000.000000,2.000000e+03,2000.000000,2000.000000,2.000000e+03,2000.000000
mean,442278.042063,327602.189000,11.554331,0.367000,10937.565500,353.99000,3.462500,30.588000,50.328000,20.385000,3.512394e+06,40.699189,-73.920083,1.006380e+06,194047.164560
std,156557.924309,111338.481815,8.724960,2.923796,609.125421,110.93293,1.120813,14.040756,19.339763,7.518247,1.127946e+06,0.092283,0.130334,3.615905e+04,33620.762108
min,2188.000000,100233.000000,0.000000,0.000000,83.000000,101.00000,1.000000,1.000000,23.000000,10.000000,1.000900e+06,40.502186,-74.252604,9.140101e+05,122330.772400
25%,305760.000000,227061.000000,4.000000,0.000000,10454.000000,305.00000,3.000000,19.000000,32.000000,14.000000,3.019450e+06,40.628479,-73.978564,9.901910e+05,168274.068400
50%,444341.000000,325282.500000,9.000000,0.000000,11214.000000,405.00000,4.000000,30.000000,51.000000,20.000000,4.025400e+06,40.697102,-73.901349,1.011561e+06,193275.611500
75%,577528.000000,407185.000000,16.000000,0.000000,11367.000000,413.00000,4.000000,44.000000,63.000000,24.000000,4.119150e+06,40.762257,-73.823494,1.033144e+06,217033.736700
max,721015.000000,602600.000000,72.000000,47.000000,11694.000000,503.00000,5.000000,51.000000,87.000000,36.000000,5.032300e+06,40.904696,-73.701929,1.066848e+06,268917.077000

In [56]:
# Select few columns 
df2 = subset[['created_at','tree_id','tree_dbh','status','address','boroname','Latitude', 'longitude']]
df2.columns.values

array(['created_at', 'tree_id', 'tree_dbh', 'status', 'address',
       'boroname', 'Latitude', 'longitude'], dtype=object)

In [57]:
# Check the first 5 observations
df2.head()

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
37769,09/04/2015,689591.0,2.0,Alive,104-008 ROCKAWAY BEACH BOULEVARD,Queens,40.583219,-73.825704
28774,07/18/2016,273491.0,2.0,Alive,85-048 AVON STREET,Queens,40.716603,-73.781423
33792,05/17/2016,350096.0,7.0,Alive,202-007 104 AVENUE,Queens,40.709376,-73.756598
44742,09/12/2015,675351.0,5.0,Alive,653 BEACH 67 STREET,Queens,40.598437,-73.796819
34629,08/21/2016,247557.0,10.0,Alive,2310 GLENWOOD ROAD,Brooklyn,40.633168,-73.954601

In [58]:
# Check the first 5 observations
df2.tail()

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
49010,08/25/2016,228433.0,10.0,Alive,698 EASTERN PARKWAY,Brooklyn,40.669471,-73.945232
9100,11/03/2015,462702.0,15.0,Alive,1776 EAST 92 STREET,Brooklyn,40.630063,-73.891081
47079,10/06/2015,596359.0,27.0,Alive,3228 EASTCHESTER ROAD,Bronx,40.874136,-73.844677
30825,06/20/2016,300629.0,26.0,Alive,81-060 247 STREET,Queens,40.738645,-73.721917
21942,12/11/2015,402663.0,10.0,Alive,274 SOUTH RAILROAD STREET,Staten Island,40.537445,-74.185961

### Rename Columns

## Duplicate Values.

These are rows that have exactly the same values across all columns. Since the tree_id uniqely identifies each tree, we will count values in this column.

In [59]:
duplicates = len(df2['tree_id'])-len(df2['tree_id'].drop_duplicates())
duplicates

2

### Remove duplicates

In [60]:
df2.drop_duplicates(subset="tree_id", keep=False, inplace=True)

# Check if duplicate values have been removed 
len(f'New dataframe has {df2} observations.')

C:\Users\Admin\AppData\Local\Temp\ipykernel_12116\3704577207.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df3 = df2.drop_duplicates(subset="tree_id", keep=False, inplace=True)

1997

### Split Columns.

The address, 23-091 29 STREET, column consists of house number as 23-091 and street name as 29 STREET. Lets split these and place each in its own column.

In [61]:
# Check if any column contains a muissing value
print(df2.isnull().any())

created_at    False
tree_id       False
tree_dbh       True
status         True
address       False
boroname      False
Latitude      False
longitude     False
dtype: bool

In [75]:
# Sort by tree_id

# Sorting by column 'Country'
df2 = df2.sort_values(by=['tree_id'])
df2


# df2

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude
434,12/09/2015,2188.0,7.0,Alive,148 PETRUS AVENUE,Staten Island,40.546359,-74.171486
37004,09/13/2016,18096.0,31.0,Alive,2355 EAST 18 STREET,Brooklyn,40.593280,-73.952370
12956,09/05/2016,23840.0,13.0,Alive,172-011 67 AVENUE,Queens,40.734688,-73.796834
5274,06/16/2016,30087.0,12.0,Alive,78-057 268 STREET,Queens,40.748385,-73.704446
27837,09/13/2016,47722.0,5.0,Alive,772 MAC DONOUGH STREET,Brooklyn,40.684187,-73.915534
...,...,...,...,...,...,...,...,...
28663,08/17/2015,720179.0,12.0,Alive,2164 78 STREET,Brooklyn,40.606851,-73.989909
30374,08/28/2015,720344.0,11.0,Alive,33-040 74 STREET,Queens,40.753596,-73.892652
22917,08/30/2015,720487.0,2.0,Alive,65-036 99 STREET,Queens,40.728928,-73.855504
10254,08/26/2015,720526.0,6.0,Alive,66 BARBEY STREET,Brooklyn,40.681592,-73.889845
3965,09/07/2015,721015.0,21.0,Alive,100 WEST 79 STREET,Manhattan,40.781923,-73.975323

In [76]:
# changing the max_rows value to display all the rows
pd.set_option('display.max_rows', 100)

# Split the address column, by default uses space
df2["address"].str.split()

434            [148, PETRUS, AVENUE]
37004       [2355, EAST, 18, STREET]
12956          [172-011, 67, AVENUE]
5274           [78-057, 268, STREET]
27837    [772, MAC, DONOUGH, STREET]
                    ...
28663             [2164, 78, STREET]
30374           [33-040, 74, STREET]
22917           [65-036, 99, STREET]
10254           [66, BARBEY, STREET]
3965         [100, WEST, 79, STREET]
Name: address, Length: 1997, dtype: object

In [84]:
# Split on the first space delimiter 
df2["address"].str.split(" ", n=1)

434           [148, PETRUS AVENUE]
37004       [2355, EAST 18 STREET]
12956         [172-011, 67 AVENUE]
5274          [78-057, 268 STREET]
27837    [772, MAC DONOUGH STREET]
                   ...
28663            [2164, 78 STREET]
30374          [33-040, 74 STREET]
22917          [65-036, 99 STREET]
10254          [66, BARBEY STREET]
3965         [100, WEST 79 STREET]
Name: address, Length: 1997, dtype: object

In [79]:
# Split and place each on its column 
df2["address"].str.split("-", n=1, expand=True)

                            0               1
434         148 PETRUS AVENUE            None
37004     2355 EAST 18 STREET            None
12956                     172   011 67 AVENUE
5274                       78  057 268 STREET
27837  772 MAC DONOUGH STREET            None
...                       ...             ...
28663          2164 78 STREET            None
30374                      33   040 74 STREET
22917                      65   036 99 STREET
10254        66 BARBEY STREET            None
3965       100 WEST 79 STREET            None

[1997 rows x 2 columns]

In [23]:
# Create a new dataframe with additional columns 
df3 = df2["address"].str.split(" ", n=1, expand=True)

# Rename new columns 
df3

            0                 1
4620     1023     REVERE AVENUE
1673   43-002        250 STREET
24650     384     FULTON STREET
41203       2  KINGSLAND AVENUE
48989     900   GRAND CONCOURSE
...       ...               ...
43538     429         81 STREET
36413    1299  INTERVALE AVENUE
39248  78-060         82 STREET
26693  34-016         43 STREET
25788   3-009         147 PLACE

[1998 rows x 2 columns]

In [89]:
# Extract any digits between hyphen and place in  new column 
df2['house number'] = df2["address"].str.extract(r'(\d+\-\d+)')
df2

,created_at,tree_id,tree_dbh,status,address,boroname,Latitude,longitude,house number
434,12/09/2015,2188.0,7.0,Alive,148 PETRUS AVENUE,Staten Island,40.546359,-74.171486,NaN
37004,09/13/2016,18096.0,31.0,Alive,2355 EAST 18 STREET,Brooklyn,40.593280,-73.952370,NaN
12956,09/05/2016,23840.0,13.0,Alive,172-011 67 AVENUE,Queens,40.734688,-73.796834,172-011
5274,06/16/2016,30087.0,12.0,Alive,78-057 268 STREET,Queens,40.748385,-73.704446,78-057
27837,09/13/2016,47722.0,5.0,Alive,772 MAC DONOUGH STREET,Brooklyn,40.684187,-73.915534,NaN
...,...,...,...,...,...,...,...,...,...
28663,08/17/2015,720179.0,12.0,Alive,2164 78 STREET,Brooklyn,40.606851,-73.989909,NaN
30374,08/28/2015,720344.0,11.0,Alive,33-040 74 STREET,Queens,40.753596,-73.892652,33-040
22917,08/30/2015,720487.0,2.0,Alive,65-036 99 STREET,Queens,40.728928,-73.855504,65-036
10254,08/26/2015,720526.0,6.0,Alive,66 BARBEY STREET,Brooklyn,40.681592,-73.889845,NaN
3965,09/07/2015,721015.0,21.0,Alive,100 WEST 79 STREET,Manhattan,40.781923,-73.975323,NaN